АлогистикТест2/src/Documents/алк_УстановкаФактическихПоказателей/алк_УстановкаФактическихПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УстановкаФактическихПоказателей</name>
  <registerRecords>InformationRegister.алк_ФактическиеПоказателиПроизводства</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействияФакта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияФакта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.алк_Смены</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ТипСменыУчастка/алк_ТипСменыУчастка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ТипСменыУчастка</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТипСмены</name>
    <type>
      <types>EnumRef.алк_ТипСмен</types>
    </type>
  </resources>
  <dimensions>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ТипСмен/алк_ТипСмен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ТипСмен</name>
  <enumValues>
    <name>Двухсменка</name>
  </enumValues>
  <enumValues>
    <name>Трехсменка</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/ВидыДнейПроизводственногоКалендаря/ВидыДнейПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДнейПроизводственногоКалендаря</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
  <enumValues>
    <name>Нерабочий</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_УстановкаФактическихПоказателей/Forms/ФормаДокумента/Module.bsl
//&НаСервере
//Процедура ЗавершениеЗаполненияФактическогоЗначения(Результат,ДопСвойства)
//	
//	Если Результат = Неопределено Тогда 
//		Возврат
//	КонецЕсли;
//	
//	Если Не ЗначениеЗаполнено(Объект.Участок) Тогда
//		Сообщить("Необходимо заполнить участок, чтобы деление было по сменам!");
//		Возврат; 
//	КонецЕсли;
//	
//	ЗначенияСмен = ВернутьТипСменыИКоличествоСмен(Объект.Участок)[0]; //количество + тип
//	ДелениеНаСмены = ЗначенияСмен.КоличествоСмен;
//	ТипСмены = ЗначенияСмен.ТипСмены; 
//	
//	КоличествоДнейВПериоде = День(Результат.Период.ДатаОкончания) - День(Результат.Период.ДатаНачала)+1; 

//	Повторы = ПерепроверитьТЧНаПовторыПоПоказателю(Результат.Показатель,Результат.Период,ТипСмены, КоличествоДнейВПериоде);  
//	
//	Если Повторы.Количество() > 0 Тогда
//		Для Каждого эл ИЗ Повторы Цикл
//			Сообщить(СтрШаблон("В строке №%1 уже есть показатель с таким периодом и сменой!",эл));
//		КонецЦикла;
//		Возврат;
//	КонецЕсли; 
//		
//	ЗначениеВОднойСтроке = ОКР(Результат.Значение/КоличествоДнейВПериоде/ДелениеНаСмены,3);  
//	
//	ДобавитьЗначенияВТЧ(КоличествоДнейВПериоде,ЗначениеВОднойСтроке, Результат.Показатель, Результат.Период, ТипСмены);  
//	
//	ИсправитьИтогиПоПоказателю(Результат.Значение,ЗначениеВОднойСтроке*КоличествоДнейВПериоде*ДелениеНаСмены); 
//	
//	ВывестиПодвал();
//	
//КонецПроцедуры
//&НаСервере
//Процедура ДобавитьЗначенияВТЧ(КоличествоДнейВПериоде,ЗначениеВОднойСтроке,Показатель,Период, ТипСмены)
//	
//	ДатаНачала = Период.ДатаНачала - 24*60*60;  
//		
//	Смены = ПолучитьМассивСмен(ТипСмены);
//	
//	//с делением  на смены
//	Для Счетчик = 0 ПО КоличествоДнейВПериоде-1 Цикл
//		Для Каждого эл ИЗ Смены Цикл 
//			СтрокаТЧДока = Объект.Показатели.Добавить();
//			ЗаполнитьЗначенияСвойств(СтрокаТЧДока,Новый Структура("Период,Смена,Показатель,Значение",ДатаНачала + 24*60*60,эл,Показатель,ЗначениеВОднойСтроке));
//		КонецЦикла;
//		ДатаНачала = СтрокаТЧДока.Период;
//	КонецЦикла;

//КонецПроцедуры
//&НаСервереБезКонтекста
//Функция ПолучитьМассивСмен(ТипСменДляРаспределения)
//		
//	Смены = Новый Массив;	
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	алк_Смены.Ссылка
//	|ИЗ
//	|	Справочник.алк_Смены КАК алк_Смены
//	|ГДЕ
//	|	алк_Смены.ТипСмен = &ТипСмен";
//	
//	Запрос.УстановитьПараметр("ТипСмен", ТипСменДляРаспределения);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Смены.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
//	КонецЦикла;
//	
//	Возврат Смены;
//	
//КонецФункции
//&НаСервере
//Процедура ВывестиПодвал()
//	
//	Сумма = Объект.Показатели.Итог("Значение"); 
//	
//	Элементы.ПоказателиЗначение.ТекстПодвала = Сумма;
//	
//КонецПроцедуры
////для кнопки
//&НаСервере
//Функция  ПерепроверитьТЧНаПовторыПоПоказателю(Показатель,ДобавляемыйПериод,ТипСмены,КоличествоДнейВПериоде)
//	
//	//все строки по показателю
//	НайденныеСтроки = Объект.Показатели.НайтиСтроки(Новый Структура("Показатель",Показатель)); 
//	//\\
//	
//	//найти строки по периоду и сравнивать смены и добавлять в массив отличающиеся  
//	
//	МассивПовторов = Новый Массив; 
//	
//	//1 проверка по показателю
//	Если НайденныеСтроки.Количество() = 0 Тогда 
//		Возврат МассивПовторов;
//	КонецЕсли;
//	//\\
//	
//	//Поместить период + смену в массив 
//	МассивПериодов = Новый Массив;
//	
//	ДатаНачала = ДобавляемыйПериод.ДатаНачала - 24*60*60;
//	
//	Смены = ПолучитьМассивСмен(ТипСмены);
//	
//	Для Счетчик = 1 ПО КоличествоДнейВПериоде Цикл
//		ДатаНачала = ДатаНачала + 24*60*60;
//		Для Каждого эл  ИЗ Смены Цикл
//			МассивПериодов.Добавить(Новый Структура("Период,Смена",ДатаНачала,эл));	
//		КонецЦикла;
//	КонецЦикла; 
//	//\\
//	
//	//2 проверка на период и смены
//	ТЗ = ПреобразованиеМассивКоллекцийВТаблицуЗначений(НайденныеСтроки);
//	
//	КоличествоПовторов = 0;
//	
//	Для Каждого эл ИЗ МассивПериодов Цикл 
//		Если КоличествоПовторов = ТЗ.Количество() Тогда
//			Прервать;
//		КонецЕсли;
//		Повторы = ТЗ.НайтиСтроки(Новый Структура("Период,Смена",эл.Период,эл.Смена)); 
//		Если Повторы.Количество() > 0 Тогда
//			МассивПовторов.Добавить(Повторы[0].НомерСтроки);
//			КоличествоПовторов = КоличествоПовторов + 1;
//		КонецЕсли; 
//	КонецЦикла;
//	//\\
//	
//	Возврат МассивПовторов;
//		
//КонецФункции
//&НаСервереБезКонтекста
//Функция ПреобразованиеМассивКоллекцийВТаблицуЗначений(Массив)  
//		
//	ТЗ = Новый ТаблицаЗначений; 
//	
//	ТЗ.Колонки.Добавить("НомерСтроки");  
//	ТЗ.Колонки.Добавить("Период");
//	ТЗ.Колонки.Добавить("Смена");	
//	
//	Для Каждого СтрокаМассива Из Массив Цикл
//		НоваяСтрока = ТЗ.Добавить();
//		НоваяСтрока.НомерСтроки = СтрокаМассива.НомерСтроки;
//		НоваяСтрока.Период = СтрокаМассива.Период;
//		НоваяСтрока.Смена = СтрокаМассива.Смена;
//	КонецЦикла;
//	
//	Возврат ТЗ;

//КонецФункции

//&НаКлиенте
//Процедура ПоказателиЗначениеПриИзменении(Элемент)  
//	ВывестиПодвал();
//КонецПроцедуры
//&НаКлиенте
//Процедура ПоказателиПослеУдаления(Элемент)
//	ВывестиПодвал();
//КонецПроцедуры

//&НаКлиенте
//Процедура Обновить(Команда)
//	ВывестиПодвал();
//КонецПроцедуры

//&НаКлиенте
//Асинх Процедура УчастокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)  
//	
//	Если Объект.Показатели.Количество()= 0 Тогда 
//		Возврат;
//	КонецЕсли;
//		
//	УчастокДоИзменения = Объект.Участок;
//	
//	обещание = ВопросАсинх(НСтр("ru='Вы хотите очистить табличную часть?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
//	Результат = Ждать обещание; // тут выполнение остановится пока пользователь не ответит на вопрос
//	
//	Если Результат = КодВозвратаДиалога.Нет Тогда
//		Объект.Участок = УчастокДоИзменения;
//		Возврат;
//	КонецЕсли;	
//	
//	Объект.Показатели.Очистить(); 

//КонецПроцедуры       

//&НаКлиенте
//Процедура ПоказателиСменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
//		
//	Если Не ЗначениеЗаполнено(Объект.Участок) Тогда 
//		Сообщить("Необходимо заполнить участок!");
//		Возврат;
//	КонецЕсли;
//	
//	СтандартнаяОбработка = Ложь;
//	
//	ТипСмены = ВернутьТипСменыИКоличествоСмен(Объект.Участок)[0].ТипСмены;
//	
//	МассивСменПоТипу = ПолучитьМассивСмен(ТипСмены); 
//	
//	Элемент.СписокВыбора.Очистить();
//	
//	Для Каждого эл ИЗ МассивСменПоТипу Цикл
//		Элемент.СписокВыбора.Добавить(эл);
//	КонецЦикла;

//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьОбщуюТаблицуПоказателей();  
	УстановитьПериод();
	Если ЗначениеЗаполнено(Объект.Дата) Тогда 
		Возврат;
	КонецЕсли;
	Объект.Дата = ТекущаяДата();	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьОбщуюТаблицуПоказателей()
	ТаблицаПоказателей = Объект.Показатели.Выгрузить(,"Показатель, Значение");
	ТаблицаПоказателей.Свернуть("Показатель", "Значение");
	
	//чтобы показатели, у которых еще нет периода не стирались 
	Для Каждого стр ИЗ ПоказателиОбщее Цикл
		Показатель = стр.Показатель;
		Если ТаблицаПоказателей.НайтиСтроки(Новый Структура("Показатель",Показатель)).Количество() = 0 Тогда 
			НСтрока = ТаблицаПоказателей.Добавить(); 
			НСтрока.Показатель = Показатель;  
		КонецЕсли;; 
	КонецЦикла;
	
	ПоказателиОбщее.Загрузить(ТаблицаПоказателей); //при открытии сворачиваем показатели и получаем итог по каждому	
КонецПроцедуры 
	
&НаКлиенте
Процедура ПоказателиОбщееПоказательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокиПоказателей = ПоказателиОбщее.НайтиСтроки(Новый структура("Показатель", ВыбранноеЗначение));
	Если СтрокиПоказателей.Количество() > 0 тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранный показатель уже введен в документе. Дублирование показателей в документе запрещено");
	КонецЕсли;
	//ПоказательДоИзменения = Элементы.ПоказателиОбщее.ТекущиеДанные.Показатель;
	//Если ЗначениеЗаполнено(ПоказательДоИзменения) тогда
	//	Для каждого СтрокаПоказателей из Объект.Показатели Цикл
	//		Если СтрокаПоказателей.Показатель = ПоказательДоИзменения тогда
	//			СтрокаПоказателей.Показатель = ВыбранноеЗначение;
	//		КонецЕсли;
	//	КонецЦикла;
	//Иначе 
	//	ЗначениеПоказателя = Элементы.ПоказателиОбщее.ТекущиеДанные.Значение;
	//	РаспределитьПоказательПоДням(ВыбранноеЗначение, ЗначениеПоказателя);
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДетальноПоДням(Команда)
	
	//Если Не ЗначениеЗаполнено(Объект.Участок) Тогда
	//	Сообщить("Необходимо заполнить участок, чтобы деление было по сменам!");
	//	Возврат; 
	//КонецЕсли;
	//		
	//ЗавершениеЗаполненияФактическогоЗначения = Новый ОписаниеОповещения("ЗавершениеЗаполненияФактическогоЗначения", ЭтаФорма);
	//
	//ОткрытьФорму("Документ.алк_УстановкаФактическихПоказателей.Форма.Форма", , ЭтаФорма,,,,ЗавершениеЗаполненияФактическогоЗначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ТекущииеДанные = Элементы.ПоказателиОбщее.ТекущиеДанные;
	Если ТекущииеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Объект.Участок)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаНачалаДействияФакта) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияДействияФакта) Тогда 
		Если ТекущииеДанные = Неопределено Тогда 
			Сообщить("Выделите строку с необходимым показателем!"); 
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Участок) Тогда 
			Сообщить("Заполните участок!"); 
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаДействияФакта) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияДействияФакта) Тогда 
			Сообщить("Выберите период действия фактических показателей!"); 
		КонецЕсли;
		Возврат;
	КонецЕсли;    
	ПоказательРасшифровки = ТекущииеДанные.Показатель;
	Элементы.Показатели.ОтборСтрок = Новый ФиксированнаяСтруктура("Показатель", ПоказательРасшифровки);	
	Элементы.СтраницыПоказателей.ТекущаяСтраница = Элементы.СтрДетальныеПоказатели; 
	Если Объект.Показатели.НайтиСтроки(Новый Структура("Показатель", ПоказательРасшифровки)).Количество() <> 0 Тогда 
		ПересчитатьИтоги();
		Возврат;
	КонецЕсли;
	РаспределитьПоказательПоДням(ПоказательРасшифровки); 	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказателиОбщееПередУдалением(Элемент, Отказ)
	УдаляемыйПоказатель = Элементы.ПоказателиОбщее.ТекущиеДанные.Показатель;
	УдалитьПоказатель(УдаляемыйПоказатель);
КонецПроцедуры 

&НаКлиенте
Процедура УдалитьПоказатель(УдаляемыйПоказатель)
	
	Счетчик = Объект.Показатели.Количество();
	
	Пока Счетчик > 0 Цикл
		Счетчик = Счетчик - 1;
		Если Объект.Показатели[Счетчик].Показатель = УдаляемыйПоказатель Тогда
			Объект.Показатели.Удалить(Объект.Показатели[Счетчик]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКСпискуПоказателей(Команда)
	ЗаполнитьОбщуюТаблицуПоказателей();
	Элементы.СтраницыПоказателей.ТекущаяСтраница = Элементы.СтрОбщиеПоказатели;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтоги() 
	Элементы.ПоказателиЗначение.ТекстПодвала = Объект.Показатели.Итог("Значение");	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоказательПоДням(Показатель) //ЗначениеПоказателя)
	
	УдалитьПоказатель(Показатель);
	
	//Смены
	Смены = ПолучитьМассивСмен(Показатель,Объект.Участок);
	Если Смены = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	//\\
	
	СтруктураДней = ПолучитьСписокРабочихДней(ПериодДействияДокумента.ДатаНачала, ПериодДействияДокумента.ДатаОкончания, ВернутьПроизКалендарь(), Смены);		
	Первый = Истина;
	
	Для каждого Стр из СтруктураДней.РезультатЗапроса Цикл
		НоваяСтрокаПоказателя = Объект.Показатели.Добавить();
		НоваяСтрокаПоказателя.Период = Стр.Дата;
		НоваяСтрокаПоказателя.Смена = Стр.Смена;
		НоваяСтрокаПоказателя.Показатель = Показатель;
		//НоваяСтрокаПоказателя.Значение = Окр(ЗначениеПоказателя / СтруктураДней.КоличествоДней, 4, РежимОкругления.Окр15как20);
		//Если Первый тогда
		//	//Пересчет погрешности
		//	НоваяСтрокаПоказателя.Значение = НоваяСтрокаПоказателя.Значение + (ЗначениеПоказателя - НоваяСтрокаПоказателя.Значение * СтруктураДней.КоличествоДней);
		//	Первый = Ложь;
		//КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьМассивСмен(Показатель,Участок) 
	
	Смены = Новый Массив;	
	
	ТипСменДляРаспределения = ВернутьТипСменыИКоличествоСмен(Участок); 
	
	Если ТипСменДляРаспределения = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_Смены.Ссылка
	|ИЗ
	|	Справочник.алк_Смены КАК алк_Смены
	|ГДЕ
	|	алк_Смены.ТипСмен = &ТипСмен";
	
	Запрос.УстановитьПараметр("ТипСмен", ТипСменДляРаспределения[0].ТипСмены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Смены.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат Смены;
	
КонецФункции
//возвращает тип смены и количество смен
&НаСервереБезКонтекста
Функция ВернутьТипСменыИКоличествоСмен(Участок) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ТипСменыУчасткаСрезПоследних.ТипСмены,
	               |	ВЫБОР
	               |		КОГДА алк_ТипСменыУчасткаСрезПоследних.ТипСмены = ЗНАЧЕНИЕ(Перечисление.алк_ТипСмен.Двухсменка)
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК КоличествоСмен
	               |ИЗ
	               |	РегистрСведений.алк_ТипСменыУчастка.СрезПоследних КАК алк_ТипСменыУчасткаСрезПоследних
	               |ГДЕ
	               |	алк_ТипСменыУчасткаСрезПоследних.Участок = &Участок"; 
	
	Запрос.УстановитьПараметр("Участок",Участок);
		
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьПроизКалендарь() 		
	Возврат Справочники.ПроизводственныеКалендари.НайтиПоКоду("РФ");	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокРабочихДней(ДатаНачала, ДатаОкончания, ПроизводственныйКалендарь, Смены)
	Результат = новый структура("КоличествоДней, РезультатЗапроса");
	
	ТЗСмены = Новый ТаблицаЗначений;
	ТЗСмены.Колонки.Добавить("Смена", Новый ОписаниеТипов("СправочникСсылка.алк_Смены"));
	
	Для Каждого Смена Из Смены Цикл
		Стр = ТЗСмены.Добавить();
		Стр.Смена = Смена;
	КонецЦикла;
	
	Запрос = новый запрос(
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата КАК Дата
	|ПОМЕСТИТЬ втДни
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	И ДанныеПроизводственногоКалендаря.Год = &Год
	|	И ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ДанныеПроизводственногоКалендаря.ВидДня <> &ВидНерабочийДень
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Смены.Смена
	|ПОМЕСТИТЬ втСмены
	|ИЗ
	|	&Смены КАК Смены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДни.Дата КАК Дата,
	|	втСмены.Смена КАК Смена
	|ИЗ
	|	втДни КАК втДни
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСмены КАК втСмены
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата");
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", ПроизводственныйКалендарь);
	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ДатаОкончания);
	Запрос.УстановитьПараметр("ВидНерабочийДень", Перечисления.ВидыДнейПроизводственногоКалендаря.Нерабочий);
	Запрос.УстановитьПараметр("Год", Год(ДатаНачала));
	Запрос.УстановитьПараметр("Смены", ТЗСмены);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Результат.КоличествоДней = РезультатЗапроса.Количество();
	Результат.РезультатЗапроса = ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса);
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура УстановитьПериод()
	ПериодДействияДокумента.ДатаНачала 		= Объект.ДатаНачалаДействияФакта;
	ПериодДействияДокумента.ДатаОкончания 	= Объект.ДатаОкончанияДействияФакта;
КонецПроцедуры

&НаКлиенте
Процедура ПериодДействияФактаПриИзменении(Элемент) 
	Если (НЕ ЗначениеЗаполнено(Объект.ДатаНачалаДействияФакта) И НЕ ЗначениеЗаполнено(Объект.ДатаОкончанияДействияФакта))
		ИЛИ Объект.Показатели.Количество() = 0 Тогда 
		ПриИзмененииПериода();
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ОкончаниеИзмененияПериода",ЭтаФорма),"Значения фактических показателей будут очищены. Продолжить?",РежимДиалогаВопрос.ОКОтмена
		,,,"Внимание!");
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ОкончаниеИзмененияПериода(Результат,ДопСвойства) Экспорт 

	Если Результат = КодВозвратаДиалога.Отмена Тогда 
		УстановитьПериод();
		Возврат
	КонецЕсли;
	
	Объект.Показатели.Очистить(); 
	ПриИзмененииПериода();
	Для Каждого показатель ИЗ ПоказателиОбщее Цикл
		показатель.Значение = 0;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПериода() 
	Объект.ДатаНачалаДействияФакта 		= ПериодДействияДокумента.ДатаНачала;
	Объект.ДатаОкончанияДействияФакта 	= ПериодДействияДокумента.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиЗначениеПриИзменении(Элемент)
	Элементы.ПоказателиЗначение.ТекстПодвала = Объект.Показатели.Итог("Значение");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеОтБазы(Команда)
	//предупреждение о замене значений во всех показателях
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьЗначениеОтБазыЗавершение", ЭтаФорма);
	ПоказатьВводЗначения(ОписаниеОповещения, 0, "Введите суммарное значение", Тип("Число"));
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьЗначениеОтБазыЗавершение(Результат, Параметры) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда 
		Возврат;
	КонецЕсли;
		
	СтрокиПоказателя = Объект.Показатели.НайтиСтроки(Новый Структура("Показатель", ПоказательРасшифровки));
	КолСтрокВТЧ = СтрокиПоказателя.Количество();
	
	Значение = ОКР(Результат/КолСтрокВТЧ,3);    
	
	Для Каждого стр ИЗ СтрокиПоказателя Цикл  
		стр.Значение = Значение;
	КонецЦикла;
	
	ИсправитьИтогиПоПоказателю(Значение,Результат,Значение*КолСтрокВТЧ,КолСтрокВТЧ-1);			
	ПересчитатьИтоги();
	
КонецПроцедуры 

//используется, когда добавляют кнопкой показатель по периоду, чтобы убрать погрешность
&НаСервере
Процедура ИсправитьИтогиПоПоказателю(ЗначениеНаСтроку,ВведенноеКолПользователем,ПолученноеКолПрограммой,ИндексПоследнейСтроки) 
	
	Если ВведенноеКолПользователем = ПолученноеКолПрограммой Тогда 
		Возврат;
	КонецЕсли;
	
	//добавляем разницу в конец 
	Если ВведенноеКолПользователем > ПолученноеКолПрограммой Тогда 
		Разница = ВведенноеКолПользователем - ПолученноеКолПрограммой;
		Объект.Показатели[ИндексПоследнейСтроки].Значение = ЗначениеНаСтроку + Разница;
		Возврат;
	КонецЕсли; 
	//\\
	
	//убираем разницу с последнего 
	Если ВведенноеКолПользователем < ПолученноеКолПрограммой Тогда  
		Разница = ПолученноеКолПрограммой - ВведенноеКолПользователем;
		Объект.Показатели[ИндексПоследнейСтроки].Значение = ЗначениеНаСтроку - Разница;
		Возврат;
	КонецЕсли; 
	//\\
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначение(Команда)   
	ВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элементы.Показатели.ВыделенныеСтроки);
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьЗначениеВКаждуюСтроку", ЭтаФорма, Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки));
	ПоказатьВводЗначения(ОписаниеОповещения, 0, "Введите значение", Тип("Число"));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеВКаждуюСтроку(Результат, Параметры) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда 
		Возврат;
	КонецЕсли;
		
	СтрокиПоказателя = Параметры.ВыделенныеСтроки; 
		
	Для Каждого стр ИЗ СтрокиПоказателя Цикл  
		Элементы.Показатели.ТекущаяСтрока = стр;
		Объект.Показатели[Элементы.Показатели.ТекущиеДанные.НомерСтроки-1].Значение = Результат;
	КонецЦикла;
		
	ПересчитатьИтоги();
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьЗначениеНаДеньПоСменно(Команда) 
	ВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элементы.Показатели.ВыделенныеСтроки);
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьЗначениеВКаждыйДеньДеляНаСменыРавномерно", ЭтаФорма, Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки));
	ПоказатьВводЗначения(ОписаниеОповещения, 0, "Введите суммарное значение на день", Тип("Число"));
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьЗначениеВКаждыйДеньДеляНаСменыРавномерно(Результат, Параметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокиПоказателя = Параметры.ВыделенныеСтроки;  
	
	Для Каждого стр ИЗ СтрокиПоказателя Цикл  
		Элементы.Показатели.ТекущаяСтрока = стр; 
		Строка = Объект.Показатели[Элементы.Показатели.ТекущиеДанные.НомерСтроки-1]; 
		СтрокиВсеСмены = Объект.Показатели.НайтиСтроки(Новый Структура("Показатель,Период",Строка.Показатель,Строка.Период));
		КолСмен = СтрокиВсеСмены.Количество(); 
		Значение = ОКР(Результат/КолСмен,3);
		ОбщееЗначениеДолжно = Результат; 
		ОбщееЗначениеПолучилось = 0;
		Для Каждого строки ИЗ СтрокиВсеСмены Цикл 
			ИндексСтроки = Объект.Показатели.Индекс(строки);  
			Объект.Показатели[ИндексСтроки].Значение = Значение;
			ОбщееЗначениеПолучилось = ОбщееЗначениеПолучилось + Значение;
		КонецЦикла;
		ИсправитьИтогиПоПоказателю(Значение,ОбщееЗначениеДолжно,ОбщееЗначениеПолучилось,ИндексСтроки);
	КонецЦикла;
	
	ПересчитатьИтоги();
	
КонецПроцедуры
